Revit 2027 API
ExternalDataManagerTool Properties
The ExternalDataManagerTool type exposes the following members.
Properties
Name | Description
CommandId |  The id of the root command represented by this tool item.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
ExternalDataManagerTool Class
Autodesk.Revit.UI Namespace